tap "eddieantonio/eddieantonio"
brew "bat"
brew "cmake"
brew "direnv"
brew "eza"
brew "git-delta"
brew "htop"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node" # Copilot
brew "python@3"
brew "python@3.12"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "rip2"
brew "starship"
brew "texlive"
brew "watch"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "eddieantonio/eddieantonio/imgcat"
cask "appcleaner"
cask "box-drive"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"
mas "Pure Paste", id: 1611378436
mas "RunCat", id: 1429033973
