tap "homebrew/bundle"
brew "bat"
brew "curl"
brew "direnv"
brew "eza"
brew "gcc"
brew "git"
brew "git-delta"
brew "htop"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "python@3"
brew "python@3.12"
brew "ripgrep"
brew "rm-improved"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"
mas "Ethernet Menubar", id: 1549412235
mas "Pure Paste", id: 1611378436
mas "RunCat", id: 1429033973
