brew "bat"
brew "cmake"
brew "cpplint"
brew "curl"
brew "direnv"
brew "eza"
brew "gcc"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "htop"
brew "latexindent"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "mypy"
brew "neovim"
brew "pandoc"
brew "prettier"
brew "python@3"
brew "ripgrep"
brew "ruff"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "tree-sitter"
brew "wget"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "homebrew/bundle"
