brew "bat"
brew "cmake"
brew "cpplint"
brew "curl"
brew "direnv"
brew "eza"
brew "gcc"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "htop"
brew "isort"
brew "latexindent"
brew "lazygit"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "mas"
brew "mypy"
brew "neovim"
brew "pandoc"
brew "prettier"
brew "python@3"
brew "ripgrep"
brew "ruff"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "tree-sitter"
brew "wget"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "box-drive"
cask "clipy"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "keyboardcleantool"
cask "mactex-no-gui"
cask "mark-text"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "webex"
cask "wezterm"
mas "Ethernet Menubar", id: 1549412235
mas "Pure Paste", id: 1611378436
mas "RunCat", id: 1429033973
tap "homebrew/bundle"
